**# ****object oriented programming******

In [1]:
a=4
print(type(a))

<class 'int'>

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("50_Startups.csv")
df.head()

         RND      ADMIN        MKT       STATE     PROFIT
0  165349.20  136897.80  471784.10    New York  192261.83
1  162597.70  151377.59  443898.53  California  191792.06
2  153441.51  101145.55  407934.54     Florida  191050.39
3  144372.41  118671.85  383199.62    New York  182901.99
4  142107.34   91391.77  366168.42     Florida  166187.94

In [4]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [5]:
class Car:
    def __init__(self, brand):  # The constructor
        self.brand = brand      # Initialize the brand attribute

# Creating an object from the class
my_car = Car("Toyota")  # "Toyota" is passed to __init__ as the brand

# Accessing the brand attribute
print(my_car.brand)

Toyota

In [6]:
class car:
    def __init__(self,brand):
        self.brand=brand
my_car = car("toyota")
print( my_car.brand)

toyota

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RND     50 non-null     float64
 1   ADMIN   50 non-null     float64
 2   MKT     50 non-null     float64
 3   STATE   50 non-null     object
 4   PROFIT  50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [8]:
df.sort_values(by=["STATE", "PROFIT"], ascending=False)

          RND      ADMIN        MKT       STATE     PROFIT
0   165349.20  136897.80  471784.10    New York  192261.83
3   144372.41  118671.85  383199.62    New York  182901.99
5   131876.90   99814.71  362861.36    New York  156991.12
8   120542.52  148718.95  311613.29    New York  152211.77
15  114523.61  122616.84  261776.23    New York  129917.04
17   94657.16  145077.58  282574.31    New York  125370.37
19   86419.70  153514.11       0.00    New York  122776.86
21   78389.47  153773.43  299737.29    New York  111313.02
24   77044.01   99281.34  140574.81    New York  108552.04
27   72107.60  127864.55  353183.81    New York  105008.31
29   65605.48  153032.06  107138.38    New York  101004.64
31   61136.38  152701.92   88218.23    New York   97483.56
35   46014.02   85047.44  205517.64    New York   96479.51
38   20229.59   65947.93  185265.10    New York   81229.06
43   15505.73  127382.30   35534.17    New York   69758.98
45    1000.23  124153.04    1903.93    New York   64926.08
48     542.05   51743.15       0.00    New York   35673.41
2   153441.51  101145.55  407934.54     Florida  191050.39
4   142107.34   91391.77  366168.42     Florida  166187.94
7   130298.13  145530.06  323876.68     Florida  155752.60
10  101913.08  110594.11  229160.95     Florida  146121.95
12   93863.75  127320.38  249839.44     Florida  141585.52
14  119943.24  156547.42  256512.92     Florida  132602.65
18   91749.16  114175.79  294919.57     Florida  124266.90
22   73994.56  122782.75  303319.26     Florida  110352.25
23   67532.53  105751.03  304768.73     Florida  108733.99
26   75328.87  144135.98  134050.07     Florida  105733.54
28   66051.52  182645.56  118148.20     Florida  103282.38
30   61994.48  115641.28   91131.24     Florida   99937.59
33   55493.95  103057.49  214634.81     Florida   96778.92
36   28663.76  127056.21  201126.82     Florida   90708.19
41   27892.92   84710.77  164470.71     Florida   77798.83
46    1315.46  115816.21  297114.46     Florida   49490.75
1   162597.70  151377.59  443898.53  California  191792.06
6   134615.46  147198.87  127716.82  California  156122.51
9   123334.88  108679.17  304981.62  California  149759.96
11  100671.96   91790.61  249744.55  California  144259.40
13   91992.39  135495.07  252664.93  California  134307.35
16   78013.11  121597.55  264346.06  California  126992.93
20   76253.86  113867.30  298664.47  California  118474.03
25   64664.71  139553.16  137962.62  California  107404.34
32   63408.86  129219.61   46085.25  California   97427.84
34   46426.07  157693.92  210797.67  California   96712.80
37   44069.95   51283.14  197029.42  California   89949.14
39   38558.51   82982.09  174999.30  California   81005.76
40   28754.33  118546.05  172795.67  California   78239.91
42   23640.93   96189.63  148001.11  California   71498.49
44   22177.74  154806.14   28334.72  California   65200.33
47       0.00  135426.92       0.00  California   42559.73
49       0.00  116983.80   45173.06  California   14681.40

In [9]:
df.groupby(by="STATE").agg({"PROFIT":"mean"})

                   PROFIT
STATE
California  103905.175294
Florida     118774.024375
New York    113756.446471

##### HOW TO DEFINE A CLASS IN PYTHON

In [10]:
class Person:

    # Create a constructor function
    def  __init__(self, name:str, age:int, gender:str, occupation:str):
        self.name = name
        self.age = age
        self.gender = gender
        self.occupation = occupation

    # Create functions for class person
    def talk(self):
        print(f"Hi there my name is : {self.name}")
        print(f"I am currently {self.age} years old")
        print(f"I am a {self.gender}")
        print(f"I work as {self.occupation}")

In [11]:
p1 = Person(name = "Sarthak", age = 23, gender= "male", occupation= "Engineer")
print(type(p1))

<class '__main__.Person'>

In [12]:
class person:
    #create a constructor function
    def __init__(self, name:str, age:int,gender:str, occupation:str):
        self.name = name
        self.age =age
        self.gender = gender
        self.occupation = occupation
        

    def talk(self):
        print(f"Hi there my name is : {self.name}")
        print(f"I am currently {self.age} years old")
        print(f"I am a {self.gender}")
        print(f"I work as {self.occupation}")

In [13]:
p1 = person(name = "sarthak", age= 23, gender= "male", occupation= "Engineer")
print(type(p1))

<class '__main__.person'>

In [14]:
p1.name

'sarthak'

In [15]:
p1.age

23

In [16]:
p1.gender

'male'

In [17]:
p1.occupation

'Engineer'


**Declaring person2**

In [18]:

p2 = Person("Aditi", 20, "female", "HR")
print(type(p2))

<class '__main__.Person'>

In [19]:
p2.name

'Aditi'

In [20]:
p2.gender

'female'

In [21]:

p2.occupation

'HR'

In [22]:
p2.talk()

Hi there my name is : Aditi
I am currently 20 years old
I am a female
I work as HR

In [23]:
p2.occupation ="Data scientist"

In [24]:
p2.talk()

Hi there my name is : Aditi
I am currently 20 years old
I am a female
I work as Data scientist

**some disadvantage of creating raw class**

In [25]:
p3=person(name=23, age="raman", gender="engineer",occupation="M")
p3

In [26]:
p3.name

23

In [27]:
p3.age

'raman'

In [28]:
p3.gender

'engineer'

# so we use dataclass in python

# DATACLASS IN PYTHON

In [29]:
a=3
isinstance(a, int)

True

In [30]:
isinstance(a, str)

False

In [31]:

isinstance(a, (int, float))

True

In [32]:
b=["Example","Rohan","Rahul"]

In [33]:
" ".join(b)

'Example Rohan Rahul'

In [34]:
print("\n" .join(b))

Example
Rohan
Rahul

In [35]:
from dataclasses import dataclass
from typing import Literal

In [36]:
@dataclass
class person2:
     #define all variable
     name:str
     age:int
     gender:Literal["male" "female"]
     occupation:str


     #validate the input
     def __post_init__(self):
          errors =[]

          if not isinstance(self.name,str):
               error.append("name should be a string")


          if not isinstance(self.age, int) or self.age<= 0:
            errors.append("Age should should be an integer and greater than 0")
          if self.gender not in ["male", "female"]:
            errors.append("Gender should be a string either male or female")
          if not isinstance(self.occupation, str):
            errors.append("Occupation should be a string")

          if errors:
            raise ValueError("\n".join(errors))


        
     def introduce(self):
        print(f"Hi there my name is {self.name}")
        print(f"My age is {self.age} years")
        print(f"I am {self.gender}")
        print(f"I work as a {self.occupation}")

In [37]:
p4= person2("Rahul",28,"male", "HR")

In [38]:
p4

person2(name='Rahul', age=28, gender='male', occupation='HR')

In [39]:
p4.age

28

In [40]:
p4.gender

'male'

In [41]:
p4.introduce()

Hi there my name is Rahul
My age is 28 years
I am male
I work as a HR

In [44]:

@dataclass
class Account:
     ac_no: int
     name: str
     bal: int|float 


     def transfer(self, other_account: "Account", amount: int|float):
        if amount <= 0:
            raise ValueError("Amount must be positive")
        if amount > self.bal:
            raise ValueError(f"Insufficient balance , current balance is {self.bal}")
        self.withdraw(amount)
        other_account.deposit(amount)

In [45]:

a1 = Account(ac_no=1234, name="Sarthak", bal=5000)

In [47]:
a2 = Account(ac_no=4567, name="Rahul", bal=1000)

In [49]:
a2.transfer(a1, 300)

AttributeError: 'Account' object has no attribute 'withdraw'

In [50]:
a1.transfer(a2, 500)

AttributeError: 'Account' object has no attribute 'withdraw'